#Написать скрипт, создающий стартер (заготовку) для проекта со следующей структурой папок:
#|--my_project
#   |--mainapp
#   |--adminapp
#   |--authapp
#Примечание: подумайте о ситуации, когда некоторые папки уже есть на диске (как быть?);
# как лучше хранить конфигурацию этого стартера, чтобы в будущем можно было менять имена папок под конкретный проект;
# можно ли будет при этом расширять конфигурацию и хранить данные о вложенных папках и файлах (добавлять детали)?
# простой вариант

import os

folders = ('mainapp', 'adminapp', 'authapp')
main_folder = 'my_project'

path = [os.makedirs(os.path.join(main_folder, i)) for i in folders if not os.path.exists(os.path.join(main_folder, i))]
