#Дан список:
#['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
#Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками
#добавить кавычку до и кавычку после элемента списка, являющегося числом) и дополнить нулём до двух
#целочисленных разрядов:
#['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']

weather_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
i = 0
while i < len(weather_list):
    if weather_list[i][-1].isdigit() == True:
        if weather_list[i].isdigit() == True and int(weather_list[i]) < 10:
            weather_list[i] = '0' + weather_list[i]
        weather_list.insert(i+1,'"')
        weather_list.insert(i, '"')
        i += 2
    i += 1
print('список с кавычками:', weather_list)
full_weather_message = ' '.join(weather_list)
print('Сообщение о погоде:', full_weather_message)
